goalsetter/app/models/user.rb

    def reset_session_token!
        new_token = generate_session_token
        self.session_token = new_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "klzbB-mdXOExBuQY3IUaWw"], ["updated_at", "2019-04-05 23:34:58.671527"], ["id", 1]]