goalsetter/app/views/users/index.html.erb


<% User.all.each do |user| %>
---
SELECT "users".* FROM "users"